app/constraints/seller_route_constraint.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def current_user(request)
         User.find_by(id: request.session[:user_id])