app/controllers/home_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @brands = Brand.joins(:models).distinct
    @cars = Car.joins(:appointments).where('is_approved=true AND status=3').distinct
    @q = params[:search_query]

    args = {}
    args[:city] = params[:city] if params[:city].present?
    args[:year] = params[:year] if params[:year].present?
    args[:km] = params[:km] if params[:km].present?
    args[:brand] = params[:brand] if params[:brand].present?
    args[:model] = params[:model] if params[:model].present?
    args[:state] = params[:state] if params[:state].present?
    args[:variant] = params[:variant] if params[:variant].present?

    if @q.present?
      @cars = @cars & Car.search(@q, fields: ['city', 'year', 'km', 'brand', 'model', 'state', 'variant'], match: :word_middle, where: args,aggs: {city: {}, year: {}, km: {}, brand: {}, model: {}, state: {},variant: {}})