app/controllers/sell_used_car_controller.rb

INSERT INTO "cars" ("city", "brand", "model", "year", "variant", "state", "km", "mobile_no", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @car = Car.new(car_params)
        @car.user_id = current_user.id
        if @car.save