app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sanu3x@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."is_buyer" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def create
        user = User.find_by(email: params[:email].downcase)
        if user.present? && user.authenticate(params[:password]) && user.email_confirmed == true
            session[:user_id] = user.id
           if user.is_seller == true
            flash[:notice] = 'Logged in Successfully as a seller'
            redirect_back_or(seller_dashboard_path)
           elsif user.is_buyer == true
            flash[:notice] = 'Logged in Successfully as a buyer'
            redirect_back_or(buyer_dashboard_path)
           elsif user.is_admin == true
            flash[:notice] = 'Logged in Successfully as an admin'
            redirect_back_or(dashboard_path)
           end
        elsif user.present? && user.email_confirmed == false