app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "mobile_no", "created_at", "updated_at", "is_buyer", "confirm_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "mobile_no", "created_at", "updated_at", "is_seller", "confirm_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save
            # session[:user_id] = @user_id
            # @user.confirmation_token
            @user.save

SELECT "users".* FROM "users" WHERE "users"."confirm_token" = ? LIMIT ?  [["confirm_token", "rqy5gr9XA0yeKItBLSEwSA"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "email_confirmed" = ?, "confirm_token" = ? WHERE "users"."id" = ?  [["updated_at", "2022-06-03 05:51:28.910394"], ["email_confirmed", 1], ["confirm_token", nil], ["id", 47]]
---
    def confirm_email
        user = User.find_by(confirm_token: params[:token])
        if user
            user.email_activate
            user.save(validate: false)